stas2z/SoftSerial_STM32/SoftSerial.cpp
// Clear pending interrupt and enable receive interrupt
// Note: Clears pending interrupt
inline void
SoftSerial::txInterruptsClr ()
{
#ifdef BMAP
  *bb_perip (&(timerSerialDEV->regs).gen->SR, TX_TIMER_PENDING) = 0;	// Clear int pending
  *bb_perip (&(timerSerialDEV->regs).gen->DIER, TX_TIMER_MASK) = 1;
#else
  timerSerialDEV->SR = ~(TX_TIMER_PENDING);
  SET_BIT (timerSerialDEV->DIER, TX_TIMER_MASK);
#endif
  //dbg("txIntClr");
}


// Mask receive start bit interrupt
inline void
SoftSerial::noRXStartInterrupts ()
{
#ifdef BMAP
  bb_peri_set_bit (&EXTI_BASE->FTSR, gpioBit, 0);
#else
  CLEAR_BIT (EXTI->FTSR, 1U << gpioBit);
#endif
  //dbg("noRXstart");

}


// Enable receive start bit interrupt
// Note: Purposely does not clear pending interrupt
inline void
SoftSerial::rxStartInterrupts ()
{
#ifdef BMAP
  bb_peri_set_bit (&EXTI_BASE->FTSR, gpioBit, 1);
#else
  SET_BIT (EXTI->FTSR, 1U << gpioBit);
#endif
  //dbg("rxStartInt");
}


// Mask receive interrupt
inline void
SoftSerial::noRXInterrupts ()
{
#ifdef BMAP
  *bb_perip (&(timerSerialDEV->regs).gen->DIER, RX_TIMER_MASK) = 0;
#else
  CLEAR_BIT (timerSerialDEV->DIER, RX_TIMER_MASK);
#endif
  //dbg("noRXInt");
}


// Enable receive interrupt
// Note: Purposely does not clear pending interrupt
inline void
SoftSerial::rxInterrupts ()
{
#ifdef BMAP
  *bb_perip (&(timerSerialDEV->regs).gen->DIER, RX_TIMER_MASK) = 1;
#else
  SET_BIT (timerSerialDEV->DIER, RX_TIMER_MASK);
#endif
  //dbg("rxInt");
}


// Clear pending interrupt and enable receive interrupt
// Note: Clears pending interrupt
inline void
SoftSerial::rxInterruptsClr ()
{
#ifdef BMAP
  *bb_perip (&(timerSerialDEV->regs).gen->SR, RX_TIMER_PENDING) = 0;	// Clear int pending
  *bb_perip (&(timerSerialDEV->regs).gen->DIER, RX_TIMER_MASK) = 1;
#else
  timerSerialDEV->SR = ~(RX_TIMER_PENDING);
  SET_BIT (timerSerialDEV->DIER, RX_TIMER_MASK);
#endif
  //dbg("rxIntClr");

}


/******************************************************************************
* Specialized functions to set interrupt priorities and assign object ointers
* These are needed due to the gyrations required to support per instance ISRs
******************************************************************************/
// Set Interrupt Priority for EXTInt line
void
setEXTIntPriority (uint8_t pin, uint8_t priority)
{
#ifdef BHAL
  static const IRQn_Type irqnb[16] = {
    EXTI0_IRQn,			//GPIO_PIN_0
    EXTI1_IRQn,			//GPIO_PIN_1
    EXTI2_IRQn,			//GPIO_PIN_2
    EXTI3_IRQn,			//GPIO_PIN_3
    EXTI4_IRQn,			//GPIO_PIN_4
    EXTI9_5_IRQn,		//GPIO_PIN_5
    EXTI9_5_IRQn,		//GPIO_PIN_6
    EXTI9_5_IRQn,		//GPIO_PIN_7
    EXTI9_5_IRQn,		//GPIO_PIN_8
    EXTI9_5_IRQn,		//GPIO_PIN_9
    EXTI15_10_IRQn,		//GPIO_PIN_10
    EXTI15_10_IRQn,		//GPIO_PIN_11
    EXTI15_10_IRQn,		//GPIO_PIN_12
    EXTI15_10_IRQn,		//GPIO_PIN_13
    EXTI15_10_IRQn,		//GPIO_PIN_14
    EXTI15_10_IRQn,		//GPIO_PIN_15
  };
  HAL_NVIC_SetPriorityGrouping (NVIC_PRIORITYGROUP_4);
  HAL_NVIC_SetPriority (irqnb[get_pin_id(STM_GPIO_PIN(digitalPinToPinName(pin)))], priority, 0U);
#else
  switch ((exti_num) (PIN_MAP[pin].gpio_bit))
    {
    case EXTI0:
      nvic_irq_set_priority (NVIC_EXTI0, priority);
      break;
    case EXTI1:
      nvic_irq_set_priority (NVIC_EXTI1, priority);
      break;
    case EXTI2:
      nvic_irq_set_priority (NVIC_EXTI2, priority);
      break;
    case EXTI3:
      nvic_irq_set_priority (NVIC_EXTI3, priority);
      break;
    case EXTI4:
      nvic_irq_set_priority (NVIC_EXTI4, priority);
      break;
    case EXTI5:
    case EXTI6:
    case EXTI7:
    case EXTI8:
    case EXTI9:
      nvic_irq_set_priority (NVIC_EXTI_9_5, priority);
      break;
    case EXTI10:
    case EXTI11:
    case EXTI12:
    case EXTI13:
    case EXTI14:
    case EXTI15:
      nvic_irq_set_priority (NVIC_EXTI_15_10, priority);
      break;
    }
#endif
}


// Set Interrupt Priority for Timer Interrupts
void
setTimerIntPriority (uint8_t timerNumber, uint8_t priority)
{
#ifdef BHAL
  HAL_NVIC_SetPriorityGrouping (NVIC_PRIORITYGROUP_4);
#endif
  switch (timerNumber)
    {
#ifdef BMAP
    case 1:
      nvic_irq_set_priority (NVIC_TIMER1_UP, priority);
      nvic_irq_set_priority (NVIC_TIMER1_CC, priority);
      break;
    case 2:
      nvic_irq_set_priority (NVIC_TIMER2, priority);
      break;
    case 3:
      nvic_irq_set_priority (NVIC_TIMER3, priority);
      break;
    case 4:
      nvic_irq_set_priority (NVIC_TIMER4, priority);
      break;
#else
    case 1:
      HAL_NVIC_SetPriority (getTimerUpIrq (TIM1), priority, 0U);
      HAL_NVIC_SetPriority (getTimerCCIrq (TIM1), priority, 0U);
      break;
    case 2:
      HAL_NVIC_SetPriority (getTimerUpIrq (TIM2), priority, 0U);
      break;
    case 3:
      HAL_NVIC_SetPriority (getTimerUpIrq (TIM3), priority, 0U);
      break;
    case 4:
      HAL_NVIC_SetPriority (getTimerUpIrq (TIM4), priority, 0U);
      break;
#endif
    }
}

// Set the correct interruptObject for this instance
void
SoftSerial::setInterruptObject (uint8_t timerNumber)
{

  switch (timerNumber)
    {
    case 1:
      interruptObject1 = this;
      break;
    case 2:
      interruptObject2 = this;
      break;
    case 3:
      interruptObject3 = this;
      break;
    case 4:
      interruptObject4 = this;
      break;
    }
}


/******************************************************************************
* Constructor / Destructor
******************************************************************************/
// Constructor
SoftSerial::SoftSerial (int receivePinT = 15, int transmitPinT = 16, uint8_t rxtxTimerT = 1, uint8_t tx_channel = _TX_CHANNEL, uint8_t rx_channel = _RX_CHANNEL):
receivePin (receivePinT),
transmitPin (transmitPinT),
#ifdef BMAP
  timerSerial (rxtxTimerT),
#endif
  rxtxTimer (rxtxTimerT)
{
  init_timer_values (tx_channel, rx_channel);

#ifdef BMAP
  // Assign pointer to the hardware registers
  timerSerialDEV = timerSerial.c_dev ();
#endif

  // Translate transmit pin number to external interrupt number
#ifdef BMAP
  txport = PIN_MAP[transmitPin].gpio_device;
  txbit = PIN_MAP[transmitPin].gpio_bit;
  gpioBit = (exti_num) (txbit);
#else
  txport = get_GPIO_Port (STM_PORT (digitalPin[transmitPin]));
  txbit = STM_PIN (digitalPin[transmitPin]);
  gpioBit = get_pin_id(STM_GPIO_PIN(digitalPinToPinName(transmitPin)));
#endif

