stas2z/SoftSerial_STM32/SoftSerial.cpp
  // Setup ISR pointer for this instance and timer (one timer per instance)
  // This is a workaround for c++
  setInterruptObject (rxtxTimer);

}

SoftSerial::SoftSerial (int receivePinT = 15, int transmitPinT = 16, uint8_t rxtxTimerT = 1):
receivePin (receivePinT),
transmitPin (transmitPinT),
#ifdef BMAP
  timerSerial (rxtxTimerT),
#endif
  rxtxTimer (rxtxTimerT)
{
  init_timer_values (_TX_CHANNEL, _RX_CHANNEL);

#ifdef BMAP
  // Assign pointer to the hardware registers
  timerSerialDEV = timerSerial.c_dev ();
#endif

  // Translate transmit pin number to external interrupt number
#ifdef BMAP
  txport = PIN_MAP[transmitPin].gpio_device;
  txbit = PIN_MAP[transmitPin].gpio_bit;
  gpioBit = (exti_num) (txbit);
#else
  txport = get_GPIO_Port (STM_PORT (digitalPin[transmitPin]));
  txbit = STM_PIN (digitalPin[transmitPin]);
  gpioBit = get_pin_id(STM_GPIO_PIN(digitalPinToPinName(transmitPin)));
#endif
  // Setup ISR pointer for this instance and timer (one timer per instance)
  // This is a workaround for c++
  setInterruptObject (rxtxTimer);

}


// Destructor
SoftSerial::~SoftSerial ()
{
  end ();
}

/******************************************************************************
* TX and RX Interrupt Service Routines
******************************************************************************/
// Transmits next bit. Called by timer ch1 compare interrupt
void
SoftSerial::txNextBit (void)
{
  txbitc++;
  // State 0 through 7 - receive bits
  if (txBitCount <= 7)
    {
      if (BIT_CHECK (transmitBuffer[transmitBufferRead], txBitCount) > 0)
	tw (HIGH);
      else
	tw (LOW);

      T_SCOMP (TX_TIMER_CHANNEL,
	       ((uint16_t) T_GCOMP (TX_TIMER_CHANNEL)) + bitPeriod);

      interrupts ();
      // Bump the bit/state counter to state 8
      txBitCount++;

#if DEBUG_DELAY
      dw (DEBUG_PIN1, 1);
      dw (DEBUG_PIN1, 0);
#endif

      // State 8 - Send the stop bit and reset state to state -1
      //          Shutdown timer interrupt if buffer empty
    }
  else if (txBitCount == 8)
    {
      // Send the stop bit
      tw (HIGH);

      interrupts ();

      transmitBufferRead =
	(transmitBufferRead == SS_MAX_TX_BUFF) ? 0 : transmitBufferRead + 1;

      if ((transmitBufferRead != transmitBufferWrite) && activeTX)
	{

	  T_SCOMP (TX_TIMER_CHANNEL,
		   ((uint16_t) T_GCOMP (TX_TIMER_CHANNEL)) + bitPeriod);
	  txBitCount = 10;

	}
      else
	{

	  // Buffer empty so shutdown delay/timer until "write" puts data in
	  noTXInterrupts ();

	}

      // Send  start bit for new byte
    }
  else if (txBitCount == 10)
    {
      tw (LOW);
      interrupts ();

      T_SCOMP (TX_TIMER_CHANNEL,
	       ((uint16_t) T_GCOMP (TX_TIMER_CHANNEL)) + bitPeriod);

      txBitCount = 0;
    }

}


// Start Bit Receive ISR
inline void
SoftSerial::onRXPinChange (void)
{
  rxedgec++;			//return;
  // Test if this is really the start bit and not a spurious edge
  if ((rxBitCount == 9) && activeRX)
    {

      // Receive Timer/delay interrupt should be off now - unmask it and center the sampling time
      T_SCOMP (RX_TIMER_CHANNEL, (uint16_t) T_GCNT () + startBitPeriod);
      rxInterruptsClr ();

      // Mask pinchange interrupt to reduce needless interrupt
      //      overhead while receiving this byte
      noRXStartInterrupts ();
      interrupts ();

      // Set state/bit to first bit
      rxBitCount = 0;

    }
  else
    interrupts ();
}


// Receive next bit. Called by timer ch2 interrupt
inline void
SoftSerial::rxNextBit (void)
{
  rxbitc++;
  if (rxBitCount < 8)
    {

      T_SCOMP (RX_TIMER_CHANNEL,
	       ((uint16_t) T_GCOMP (RX_TIMER_CHANNEL)) + bitPeriod);

      receiveBuffer[receiveBufferWrite] >>= 1;
      if (digitalRead (receivePin))
	receiveBuffer[receiveBufferWrite] |= 0x80;

#if DEBUG_DELAY
      dw (DEBUG_PIN, 1);
      dw (DEBUG_PIN, 0);
#endif

      interrupts ();

      rxBitCount++;

      // State 8 - Save incoming byte and update buffer
    }
  else if (rxBitCount == 8)
    {

      // Finish out stop bit while we...  
      //  Calculate location in buffer for next incoming byte
      //  Test if buffer full
      //  If the buffer isn't full update the tail pointer to point to next location
      //  Else if it is now full set the buffer overflow flag 
      // FYI - With this logic we effectively only have an (SS_MAX_RX_BUFF - 1) buffer size

      interrupts ();
      uint8_t next = (receiveBufferWrite + 1) % SS_MAX_RX_BUFF;
      if (next != receiveBufferRead)
	receiveBufferWrite = next;
      else
	{
	  bufferOverflow = true;


#if DEBUG_DELAY
	  overFlowTail = receiveBufferWrite;
	  overFlowHead = receiveBufferRead;

	  dw (DEBUG_PIN1, 1);
	  dw (DEBUG_PIN1, 0);
#endif

	}

      // Re-enable start bit detection
      rxStartInterrupts ();

      // Shutdown nextbit timer interrupt until next start bit detected
      noRXInterrupts ();

      // Set for state 9 to receive next byte
      rxBitCount = 9;

    }
  else
    {
      interrupts ();
    }

}


/******************************************************************************
* Begin - Instance setup
******************************************************************************/
void
SoftSerial::begin (uint32_t tBaud)
{

  tw (HIGH);
  pinMode (receivePin, INPUT_PULLUP);
  pinMode (transmitPin, OUTPUT);

#if DEBUG_DELAY
  pinMode (DEBUG_PIN, OUTPUT);
  dw (DEBUG_PIN, 0);
  pinMode (DEBUG_PIN1, OUTPUT);
  dw (DEBUG_PIN1, 0);
#endif

  // Initialize the timer
  noInterrupts ();
  T_PAUSE ();

/*  if (tBaud > 38400)
    {
      bitPeriod = (uint16_t) ((uint32_t) (T_TIMFREQ()) / tBaud);
      startBitPeriod = bitPeriod + (bitPeriod / 2) - 200;
      T_SPSCALE (1);
    }
  else*/ if (tBaud > 2400)
    {
      bitPeriod = (uint16_t) ((uint32_t) (T_TIMFREQ()) / tBaud);
      startBitPeriod = bitPeriod + (bitPeriod / 2) - 300;
      T_SPSCALE (1);
    }
  else if (tBaud > 300)
    {
      bitPeriod = (uint16_t) (((uint32_t) (T_TIMFREQ()) / 16) / tBaud);
      startBitPeriod = bitPeriod + (bitPeriod / 2);
      T_SPSCALE (16);
    }
  else
    {
      bitPeriod = (uint16_t) (((uint32_t) (T_TIMFREQ()) / 16) / tBaud) / 2;
      startBitPeriod = bitPeriod + (bitPeriod / 2) - 600;
      T_SPSCALE (16);
    }

  T_SETOF (TIMER_MAX_COUNT);

  // Set transmit bit timer  
  // Compare value set later
  T_SMODE (TX_TIMER_CHANNEL, TIMER_OUTPUT_COMPARE);

  // State tx machine start state, attach bit interrupt, and mask it until a byte is sent
  transmitBufferRead = transmitBufferWrite = 0;
  txBitCount = 9;
  T_AINT (TX_TIMER_CHANNEL, handleTXBitInterruptP[rxtxTimer - 1]);
  noTXInterrupts ();

