stas2z/SoftSerial_STM32/SoftSerial.cpp
  // Set receive bit timer  
  // Compare value set later
  T_SMODE (RX_TIMER_CHANNEL, TIMER_OUTPUT_COMPARE);

  // Set rx State machine start state, attach the bit interrupt and mask it until start bit is received
  receiveBufferRead = receiveBufferWrite = 0;
  rxBitCount = 9;
  T_AINT (RX_TIMER_CHANNEL, handleRXBitInterruptP[rxtxTimer - 1]);
  noRXInterrupts ();

  // Make the timer we are using a high priority interrupt
  setTimerIntPriority (rxtxTimer, 0);

  // Load the timer values and start it
  T_RESUM ();
  T_RFR ();

  // Set start bit interrupt and priority and leave it enabled to rx first byte
  attachInterrupt (receivePin, handleRXEdgeInterruptP[rxtxTimer - 1],
		   FALLING);
  setEXTIntPriority (receivePin, 0);

  bufferOverflow = false;
  receiveBufferRead = receiveBufferWrite = 0;
  transmitBufferRead = transmitBufferWrite = 0;


  interrupts ();

  listen ();
  talk ();

}


/******************************************************************************
* RX Related Public Methods
******************************************************************************/
// Sets current instance listening. Transmit is always enabled
// If his instance was already activeRX does nothing and returns false 
bool
SoftSerial::listen ()
{

  // If receive not activeRX then re-init and set activeRX
  if (!activeRX)
    {

      // Reset receieve buffer and mark activeRX
      bufferOverflow = false;
      receiveBufferRead = receiveBufferWrite = 0;
      activeRX = true;

      // Turn the receive start bit detection on
      rxStartInterrupts ();

      return true;
    }
  return false;
}


// Stop Listening - Shuts down only RX - Use end() to stop both rx and tx
// Returns true if was listening when called
// This instance will stop all RX interrupts after current in-process
// byte is finished receiving (if any).
// If no in-process receive byte it stops immediately
bool
SoftSerial::stopListening ()
{

  if (activeRX)
    {

      noRXStartInterrupts ();
      activeRX = false;
      return true;

    }
  else
    return false;

}


// Completely shutsdown this instance
// Not an RX related method but needs to be after stopListening
void
SoftSerial::end ()
{

  stopListening ();
  T_PAUSE ();
  detachInterrupt (receivePin);
  T_DINT (RX_TIMER_CHANNEL);
  T_DINT (TX_TIMER_CHANNEL);
  T_SMODE (TX_TIMER_CHANNEL, TIMER_DISABLED);
  T_SMODE (RX_TIMER_CHANNEL, TIMER_DISABLED);
  tw (HIGH);
}


// Returns number of bytes in the RX buffer
int
SoftSerial::available ()
{
  int i;

  if (!activeRX)
    return 0;

  noRXInterrupts ();
  i =
    (receiveBufferWrite + SS_MAX_RX_BUFF -
     receiveBufferRead) % SS_MAX_RX_BUFF;
  rxInterrupts ();

  return i;
}

// Non-blocking read.
// Returns -1 if this instance isn't listening or the buffer is empty
int
SoftSerial::readnb ()
{

  if (!activeRX)
    return -1;

  if (receiveBufferRead == receiveBufferWrite)
    return -1;

  uint8_t inData = receiveBuffer[receiveBufferRead];

  noRXInterrupts ();
  receiveBufferRead = (receiveBufferRead + 1) % SS_MAX_RX_BUFF;
  rxInterrupts ();

  return inData;
}


// Blocking read to be compatible with HardwareSerial
// Blocks until byte is available in buffer
// Returns -1 if instance is not activeRX
int
SoftSerial::read ()
{

  if (!activeRX)
    return -1;

  // Wait if buffer is empty
  while (receiveBufferRead == receiveBufferWrite);

  uint8_t inData = receiveBuffer[receiveBufferRead];

  noRXInterrupts ();
  receiveBufferRead = (receiveBufferRead + 1) % SS_MAX_RX_BUFF;
  rxInterrupts ();

  return inData;
}


// Flush the receive buffer
void
SoftSerial::flush ()
{

  noRXInterrupts ();
  receiveBufferRead = receiveBufferWrite = 0;
  rxInterrupts ();

}


// Return the next item in the receive buffer but leave in buffer
int
SoftSerial::peek ()
{

  if (!activeRX)
    return -1;

  // If buffer is empty return false
  if (receiveBufferRead == receiveBufferWrite)
    return -1;

  // Otherwise read the byte at head of buffer but don't delete
  return receiveBuffer[receiveBufferRead];

}


/******************************************************************************
* TX Related Public Method(s)
******************************************************************************/
// Sets current instance enabled for sending
// If his instance was already activeRX does nothing and returns false 
bool
SoftSerial::talk ()
{

  // If transmit not active then re-init and set activeTX
  if (!activeTX)
    {

      // Reset transmit buffer and mark active
      transmitBufferRead = transmitBufferWrite = 0;
      activeTX = true;

      // Turn transmit interrupts on
      txInterrupts ();

      return true;
    }
  return false;
}


// Stop Sending - Shuts down only TX - Use end() to stop both rx and tx
// or "stopListening" for rx
// Returns true if sending already enabled when called
// This instance will stop sending at end of current byte immediately 
bool
SoftSerial::stopTalking ()
{

  if (activeTX)
    {

      while (txBitCount < 8);
      activeTX = false;
      noTXInterrupts ();
      return true;

    }
  else
    return false;

}

// Virtual write
// Saves tx byte in buffer and restarts transmit delay timer
// 1 bit time latency prior to transmit start if buffer was empty
size_t
SoftSerial::write (uint8_t b)
{
  if (txBitCount == 9)
    {
      transmitBufferRead = transmitBufferWrite = 0;
      txBitCount = 10;
    }
  // Check if transmit timer interrupt enabled and if not unmask it
  // transmit timer interrupt will get masked by transmit ISR when buffer becomes empty
  if ((!isTXInterruptEnabled ()))
    {

      // Save new data in buffer
      transmitBuffer[transmitBufferWrite] = b;
      transmitBufferWrite =
	(transmitBufferWrite == SS_MAX_TX_BUFF) ? 0 : transmitBufferWrite + 1;

      // Set state to 10 (send start bit) and re-enable transmit interrupt
      txBitCount = 10;

      T_SCOMP (TX_TIMER_CHANNEL, (int16_t) T_GCNT () + 1);
      txInterruptsClr ();

    }
  else
    {

      // Blocks if buffer full
      bool i;
      do
	{
	  i =
	    (((transmitBufferWrite + 1) % SS_MAX_TX_BUFF) ==
	     transmitBufferRead);
	}
      while (i);

      // Save new data in buffer and bump the write pointer
      transmitBuffer[transmitBufferWrite] = b;
      transmitBufferWrite =
	(transmitBufferWrite == SS_MAX_TX_BUFF) ? 0 : transmitBufferWrite + 1;
    }

  return 1;

