stas2z/SoftSerial_STM32/SoftSerial.cpp
}

/******************************************************************************
* 
* Intermediate Level Interrupt Service Routines
* One ISR for each interrupt times 4 to support 4 instantiations of the class
* on up to 4 different timers. 
* 
* This is to work around the fact that static data and
* static member functions become part of the base class and are common to all
* instantiations and ISRs must be static in order to derive a std C type pointer to
* them which is required by the NVIC and hardware timer interrupt code. If there is 
* a better way to do this I'd welcome to learn about it.
* 
* These are at the bottom of the file just to get them out of the way.
******************************************************************************/
#ifdef BHAL
#define HTIM HardwareTimer * ht
#else
#define HTIM void
#endif

inline void
SoftSerial::handleRXBitInterrupt1 (HTIM)
{
  noInterrupts ();
  interruptObject1->rxNextBit ();
  interrupts ();
}


inline void
SoftSerial::handleRXEdgeInterrupt1 ()
{
  if (interruptObject1)
    noInterrupts ();
  interruptObject1->onRXPinChange ();
  interrupts ();
}


inline void
SoftSerial::handleTXBitInterrupt1 (HTIM)
{
  noInterrupts ();
  interruptObject1->txNextBit ();
  interrupts ();
}

inline void
SoftSerial::handleRXBitInterrupt2 (HTIM)
{
  noInterrupts ();
  interruptObject2->rxNextBit ();
  interrupts ();
}


inline void
SoftSerial::handleRXEdgeInterrupt2 ()
{
  noInterrupts ();
  interruptObject2->onRXPinChange ();
  interrupts ();
}


inline void
SoftSerial::handleTXBitInterrupt2 (HTIM)
{
  noInterrupts ();
  interruptObject2->txNextBit ();
  interrupts ();
}

inline void
SoftSerial::handleRXBitInterrupt3 (HTIM)
{
  noInterrupts ();
  interruptObject3->rxNextBit ();
  interrupts ();
}


inline void
SoftSerial::handleRXEdgeInterrupt3 ()
{
  noInterrupts ();
  interruptObject3->onRXPinChange ();
  interrupts ();
}


inline void
SoftSerial::handleTXBitInterrupt3 (HTIM)
{
  noInterrupts ();
  interruptObject3->txNextBit ();
  interrupts ();
}

inline void
SoftSerial::handleRXBitInterrupt4 (HTIM)
{
  noInterrupts ();
  interruptObject4->rxNextBit ();
  interrupts ();
}


inline void
SoftSerial::handleRXEdgeInterrupt4 ()
{
  noInterrupts ();
  interruptObject4->onRXPinChange ();
  interrupts ();
}


inline void
SoftSerial::handleTXBitInterrupt4 (HTIM)
{
  noInterrupts ();
  interruptObject4->txNextBit ();
  interrupts ();

}
